#include<reg51.h>
#include"st7565.h"

//---声明一个全局变量---//
void Delay10ms(unsigned int c);

/*******************************************************************************
* 函 数 名         : main
* 函数功能		   : 主函数
* 输    入         : 无
* 输    出         : 无
*******************************************************************************/

void main()
{
	uchar i = 128;
	Lcd12864_Init();
	Lcd12864_ClearScreen();
		
	while (1)
	{
		Lcd12864_ClearScreen();		

		//--由于这个函数显示方向正好相反--//
			Lcd12864_Write16CnCHAR(0, 2, "率频");
			Delay10ms(100);
	/*	
		for (i=0; i<8; i += 2)
		{
			Lcd12864_ClearScreen();

			//--由于这个函数显示方向正好相反--//
			Lcd12864_Write16CnCHAR(0, i, "司公限有技科中普");
			Delay10ms(100);
		}
	*/
	
	}
}

/*******************************************************************************
* 函 数 名         : Delay10ms
* 函数功能		   : 延时函数，延时10ms
* 输    入         : 无
* 输    出         : 无
*******************************************************************************/

void Delay10ms(unsigned int c)   //误差 0us
{
    unsigned char a,b;
    for(;c>0;c--)
        for(b=38;b>0;b--)
            for(a=130;a>0;a--);
}
